
#include <iostream>
#include <vector>
#include <random>
using namespace std;

/*
Круговой массив - массив из элементов, в котором по достижению конца массива
следующим элементом будет снова первый. Массив задается числом n, то есть
представляет собой числа от 1 до n.
Напишите программу, которая выводит путь, по которому, двигаясь интервалом длины
m по заданному массиву, концом будет являться первый элемент.
Началом одного интервала является конец предыдущего.
Путь - массив из начальных элементов полученных интервалов.
Программа должна обрабатывать 2 массива одновременно.
Результаты необходимо объединить в один общий путь.
*/

int main()
{
    long long  n1, m1;
    long long  n2, m2;

    cin >> n1;
    while (n1 <= 0)//Проверка первого числа. Оно должно быть положительным 
    {
        cout << "The first number must be positive!"<<"\n";
        cin >> n1;
    }

    cin >> m1;
    while (m1 <= 1)//Проверка второго чилса. Чтобы мы могли двигаться, оно должно быть >=2
    {
        cout << "The second number must be greater than 1!" << "\n";
        cin >> m1;
    }

   
    //Необходимо преобразовать 2 число. Вычитаем единицы, дабы каждый раз при сложении получать последний элемент интервала
    //Мы берём остаток от деления на первое число, поскольку для ускарения вычисление лучше представить, что операции происходят в кольце (по сути кольцо n1-1, но из-за начальных условий необходимо сдвинуть все
    //цифры на 1 (0 -> 1, 1 -> 2, ... , n1-1 -> n1 
    if ((m1 - 1) %n1 == 0)
        m1 = n1; //Поэтому, если остаток от деления равен 0, нужно заменить на n1
    else
        m1 = (m1 - 1) % n1;

    n1++;//Для всех остальных вычислений увелич n1 на 1, чтобы при достижении 0 прикратить вычисления 
    vector<long long> path;
    long long  temp = 1;
    int costl;
    while (temp != 0)
    {
        path.push_back(temp);
        temp += m1;
        costl = temp > n1;//Производим сравнение с n1, посколку если число больше, то при взятии остатка от деления мы будем терять 1 (то есть n1+3 -> 2). Это происходит из-за сдвига кольца
        temp = temp % n1 + costl;
    }

    //Второй набор вычисляется аналогично
    cin >> n2;
    while (n2 <= 0)
    {
        cout << "The first number must be positive!" << "\n";
        cin >> n2;
    }

    cin >> m2;
    while (m2 <= 1)
    {
        cout << "The second number must be greater than 1!" << "\n";
        cin >> m2;
    }

   

    if ((m2 - 1) % n2 == 0)
        m2 = n2;
    else
        m2 = (m2 - 1) % n2;
    
    n2++;
    temp = 1;

    while (temp != 0)
    {
        path.push_back(temp);
        temp += m2;
        costl = temp > n2;
        temp = temp % n2 + costl;
    }
    
    for (auto i : path)
        cout << i;
}
