
#include <iostream>
#include <vector>
#include <fstream>
#include <string>

/*
Напишите программу, которая рассчитывает положение точек относительно эллипса.
Координаты центра эллипса и его радиусы считываются из файла 1.

Пример:
0 0 – координаты центра
5 3 – координаты радиуса

Координаты точек считываются из файла 2.
Пример:
0 3
0 0
6 0

Вывод для данных примеров файлов:
0
1
2

Пути к файлам передаются программе в качестве аргументов!
● файл с координатами и радиусом эллипса - 1 аргумент;
● файл с координатами точек - 2 аргумент;
● координаты - рациональные числа в диапазоне от 10^-38 до 10^38 ;
● количество точек от 1 до 100;
● вывод каждого положения точки заканчивается символом новой строки;
● соответствия ответов:
○ 0 - точка лежит на окружности
○ 1 - точка внутри
○ 2 - точка снаружи.
Вывод программы в консоль!
*/

using namespace std;
int main()
{
    //file1.TXT Названия файлов для быстрой проверки
    //file2.TXT
    long double x0, y0;//long double для выполнения условий точности
    long double a, b;
    long double dot_x, dot_y;
    long double x2, y2;
    long double answer;
    string file_adress;
    cin >> file_adress;
    ifstream in_1(file_adress);

    if (in_1.is_open())
    {
        in_1 >> x0 >> y0 >> a >> b;//Получаем координаты из первого файла
    }
    in_1.close();

    if (abs(a) < 0.00000000001)//Проверка на 0
        a = 1.0;

    if(abs(b) < 0.00000000001)
        b = 1.0;

    cin >> file_adress;
    ifstream in_2(file_adress);

    if (in_2.is_open())
    {
        while (in_2 >> dot_x >> dot_y)//Просматриваем все точки из втрого файла
        {
            x2 = (dot_x - x0) / a;//Принадлежности точки будем проверять с помощью каноничного урваения эллипса
            x2 = x2 * x2;
            y2 = (dot_y - y0) / b;
            y2 = y2 * y2;
            answer = x2 + y2;

            //Проверка на равенство единице
            if (abs(answer - 1) < 0.00000000001)//Поскольку используются числа с плавоющей толчкой, используется следующая конструкция
                cout << 0<<"\n";
            else if (answer < 1.0)
                cout << 1 << "\n";
            else
                cout << 2 << "\n";
        }
    }
    in_2.close();
}
